
## Plan Result

[CI link](https://github.com/clov3r-cc/infra/actions/runs/21958566215)


<pre><code>Plan: 0 to add, 1 to change, 0 to destroy.</code></pre>

* Update
  * proxmox_vm_qemu.domain_controller[&#34;01&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # proxmox_vm_qemu.domain_controller["01"] will be updated in-place
  ~ resource "proxmox_vm_qemu" "domain_controller" {
      + default_ipv4_address      = (known after apply)
        id                        = "prod-prox-01/qemu/106"
        name                      = "prod-adds-01"
      + ssh_host                  = (known after apply)
      + ssh_port                  = (known after apply)
        tags                      = "domain-controller;prod;terraform"
      ~ vm_state                  = "stopped" -> "running"
        # (48 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"tf_plan","PRNumber":279,"Program":"tfcmt","SHA1":"b0803cdf91f0c198749c24279c947e84bdd032cf","Vars":{},"WorkflowName":"Terraform CI"} -->